
class PrintActions:

    def print_actions_with_phonebook(self):
        print('1 - Вывести все записи телефонной книги')
        print('2 - Найти запись по одному параметру')
        print('3 - Найти запись по нескольким параметрам')
        print('4 - Добавить изменения в запись')
        print('5 - Добавить новую запись в книгу')
        print('6 - Найти и удалить запись')
        print('7 - Закончить работу с телефонной книгой')

    def print_actions_with_empty_book(self):
        print('1 - Добавить новую запись в книгу')
        print('2 - Закончить работу с телефонной книгой')

    